#!/bin/bash

######################################################################################
# 默认配置项区(通常不用修改)
######################################################################################

# 检查策略：
#     判断python的服务端口是否是指定的,若所有python程序均在运行，则检测通过，跳过本次检查

sign=0
for k in $(seq 1 ${INSTANCE_NUM})
  do
    # 判断端口是否被占用
    portk=$((${SERVER_PORT} + $k))
    netstat -ntpl | grep "[0-9]:${portk} " -q;
    if [ $? != 1 ]
    then
      sign=$((${sign} + 1))
    fi
  done

if [ ${sign} != ${INSTANCE_NUM} ]
then
  exit 1
fi
